#ตาราง
def table(**Subject):
    print(f"|ID {Subject["ID"]}\t|\t{Subject["name"]}\t|\t|{Subject["name1"]}\t|")
def Time():
    print("+-------+-------------------------------+-------+-----------------------+")
    print("|Time\t|\t09.00-12.00น.\t\t|\t|\t13.00-16.00น.\t|")
    print("+-------+-------------------------------+-------+-----------------------+")
print("=====ป้อนชื่อวิชา=====")
num1 = int(input("ป้อนหมายเลขวิชา : "))
match num1 :
    case 1:
        Listsub = [
            {"001":" ว่างนอน/นอนอย่างเดียว ","002":" เรียนPythonขั้นสูงง "},
            {"001":" เรียนอังกฤษ/LG02 ","002":" เรียนเขียนโปรแกรม/LN02 "},
            {"001":" เรียนอนิเมชั่น/LN02 ","002":" ว่างเรียนPython "},
            {"001":" เรียนศาสตร์และศิลป์/LG04 ","002":" Psychology/LN09 "},
            {"001":" เรียนออกแบบระบบ/LN02 ","002":" เรียนอังกฤษ/LN09 "},
        ]
        Time()
        for i in range (len(Listsub)):
            table(ID=(i+1) ,name=Listsub[i]["001"],name1=Listsub[i]["002"])
            print("+-------+-------------------------------+-------+-----------------------+")
    case _:
        print("ออกจากโปรแกรม")

